1033087886/esp32-cam/src/main.cpp
#include <Arduino.h>
#include <WiFi.h>
#include <HTTPClient.h>
#include <WiFiClientSecure.h>
#include <PubSubClient.h>
#include <ArduinoWebsockets.h>
#include <tiny_websockets/network/esp32/esp32_tcp.hpp>
#include "esp_camera.h"
#include <time.h>
#include <string.h>
#include <ctype.h>
#include <memory>
#include "esp_netif.h"
#include "lwip/ip6_addr.h"
#if __has_include(<esp32/spiram.h>)
#include <esp32/spiram.h>
#define HAS_SPIRAM_CHIP_API 1
#else
#define HAS_SPIRAM_CHIP_API 0
#endif

#if __has_include(<esp_arduino_version.h>)
#include <esp_arduino_version.h>
#endif

using namespace websockets;

// ArduinoWebsockets on ESP32 does not always propagate insecure mode to the
// internal WiFiClientSecure when using wss:// URL.
// Use an explicit secured TCP client and force setInsecure() here.
class InsecureSecuredEsp32TcpClient : public websockets::network::SecuredEsp32TcpClient {
public:
  InsecureSecuredEsp32TcpClient() : websockets::network::SecuredEsp32TcpClient() {
    this->client.setInsecure();
  }
};

void connectWiFi();
void doPortalAuth();
void testInternet();
void setupMqttTransport();
void syncTimeIfNeeded();
void connectMQTT();
void onWiFiEvent(WiFiEvent_t event);
void requestIPv6(const char* reason);
void refreshIPv6Status(bool verbose);
const char* classifyIPv6Type(const esp_ip6_addr_t& addr);
int ipv6TypeScore(const char* type);
void mqttCallback(char* topic, byte* payload, unsigned int length);
void publishHeartbeat();
void publishLightState();
void setFlashBrightness(uint8_t value, bool reportState);
String decodeCommandPayload(byte* payload, unsigned int length);
bool parseBrightnessCommand(String cmd, uint8_t& outValue);
bool initCamera();
void connectStreamWs();
void sendStreamFrameIfReady();
void setupTopics();
void setupFlashPwm();
void publishAck(const char* msg);
String extractJsonValue(const String& json, const String& key);
void printMemoryInfo(const char* stage);
const char* psramChipSizeText(int chipEnum);

// WiFi settings
// const char* ssid = "Keropok";
// const char* password = "ssz1151220817";
const char* ssid = "Xiaomi 13 Ultra";
const char* password = "1033087886";
// Optional captive portal auth (from ESP32-mqtt project workflow)
const bool enablePortalAuth = false;
const char* portalAuthBaseUrl = "http://192.168.100.2:8080/wportal/Onekey";
const unsigned long authInterval = 14100000UL;  // 235 minutes
unsigned long previousAuthTime = 0;

// MQTT settings
const char* mqttHost = "hea1fbf1.ala.cn-hangzhou.emqxsl.cn";
const uint16_t mqttPort = 8883;
const char* mqttUsername = "rose";
const char* mqttPassword = "123456";
const bool mqttUseTls = true;

// Fill CA cert only when mqttUseTls=true and broker uses 8883
const char* mqttCaCert = R"EOF(
-----BEGIN CERTIFICATE-----
MIIDjjCCAnagAwIBAgIQAzrx5qcRqaC7KGSxHQn65TANBgkqhkiG9w0BAQsFADBh
MQswCQYDVQQGEwJVUzEVMBMGA1UEChMMRGlnaUNlcnQgSW5jMRkwFwYDVQQLExB3
d3cuZGlnaWNlcnQuY29tMSAwHgYDVQQDExdEaWdpQ2VydCBHbG9iYWwgUm9vdCBH
MjAeFw0xMzA4MDExMjAwMDBaFw0zODAxMTUxMjAwMDBaMGExCzAJBgNVBAYTAlVT
MRUwEwYDVQQKEwxEaWdpQ2VydCBJbmMxGTAXBgNVBAsTEHd3dy5kaWdpY2VydC5j
b20xIDAeBgNVBAMTF0RpZ2lDZXJ0IEdsb2JhbCBSb290IEcyMIIBIjANBgkqhkiG
9w0BAQEFAAOCAQ8AMIIBCgKCAQEAuzfNNNx7a8myaJCtSnX/RrohCgiN9RlUyfuI
2/Ou8jqJkTx65qsGGmvPrC3oXgkkRLpimn7Wo6h+4FR1IAWsULecYxpsMNzaHxmx
1x7e/dfgy5SDN67sH0NO3Xss0r0upS/kqbitOtSZpLYl6ZtrAGCSYP9PIUkY92eQ
q2EGnI/yuum06ZIya7XzV+hdG82MHauVBJVJ8zUtluNJbd134/tJS7SsVQepj5Wz
tCO7TG1F8PapspUwtP1MVYwnSlcUfIKdzXOS0xZKBgyMUNGPHgm+F6HmIcr9g+UQ
vIOlCsRnKPZzFBQ9RnbDhxSJITRNrw9FDKZJobq7nMWxM4MphQIDAQABo0IwQDAP
BgNVHRMBAf8EBTADAQH/MA4GA1UdDwEB/wQEAwIBhjAdBgNVHQ4EFgQUTiJUIBiV
5uNu5g/6+rkS7QYXjzkwDQYJKoZIhvcNAQELBQADggEBAGBnKJRvDkhj6zHd6mcY
1Yl9PMWLSn/pvtsrF9+wX3N3KjITOYFnQoQj8kVnNeyIv/iPsGEMNKSuIEyExtv4
NeF22d+mQrvHRAiGfzZ0JFrabA0UWTW98kndth/Jsw1HKj2ZL7tcu7XUIOGZX1NG
Fdtom/DzMNU+MeKNhJ7jitralj41E6Vf8PlwUHBHQRFXGU7Aj64GxJUTFy8bJZ91
8rGOmaFvE7FBcf6IKshPECBV1/MUReXgRPTqh5Uykw7+U0b6LJ3/iyK5S9kJRaTe
pLiaWN0bfVKfjllDiIGknibVb63dDcY3fe0Dkhvld1927jyNxF1WW6LZZm6zNTfl
MrY=
-----END CERTIFICATE-----
)EOF";

const char* deviceId = "esp32cam-01";

const unsigned long wifiReconnectInterval = 5000UL;
const unsigned long mqttReconnectInterval = 5000UL;
const unsigned long mqttHeartbeatInterval = 30000UL;
const unsigned long wsReconnectInterval = 3000UL;
const unsigned long streamInterval = 66UL;  // about 5-6 FPS (better for CF relay)
const unsigned long wsPingInterval = 15000UL;
const unsigned long ipv6RetryInterval = 4000UL;
const uint8_t ipv6MaxRetry = 15;

// Stream URL copied from the HTML reference file
const char* streamWsUrl = "wss://esp.rose980.eu.cc:443/esp32";
const char* streamWsHost = "esp.rose980.eu.cc";
const uint16_t streamWsPort = 443;
const char* streamWsPath = "/esp32";

// ESP32-CAM (AI Thinker) pins
#define PWDN_GPIO_NUM 32
#define RESET_GPIO_NUM -1
#define XCLK_GPIO_NUM 0
#define SIOD_GPIO_NUM 26
#define SIOC_GPIO_NUM 27
#define Y9_GPIO_NUM 35
#define Y8_GPIO_NUM 34
#define Y7_GPIO_NUM 39
#define Y6_GPIO_NUM 36
#define Y5_GPIO_NUM 21
#define Y4_GPIO_NUM 19
#define Y3_GPIO_NUM 18
#define Y2_GPIO_NUM 5
#define VSYNC_GPIO_NUM 25
#define HREF_GPIO_NUM 23
#define PCLK_GPIO_NUM 22

const uint8_t flashLedPin = 4;

#if defined(ESP_ARDUINO_VERSION_MAJOR) && (ESP_ARDUINO_VERSION_MAJOR >= 3)
const bool useNewLedcApi = true;
#else
const bool useNewLedcApi = false;
const uint8_t flashLedChannel = 7;
#endif

WiFiClient mqttPlainClient;
WiFiClientSecure mqttTlsClient;
PubSubClient mqttClient(mqttPlainClient);
WebsocketsClient wsClient(std::make_shared<InsecureSecuredEsp32TcpClient>());
bool mqttUsingInsecure = false;

String topicCmdLight;
String topicStateLight;
String topicStateOnline;
String topicStateHeartbeat;
String topicAck;

uint8_t currentLight = 0;
unsigned long lastWifiRetryTime = 0;
unsigned long lastMqttConnectAttempt = 0;
unsigned long lastHeartbeatTime = 0;
unsigned long lastWsConnectAttempt = 0;
unsigned long lastFrameTime = 0;
unsigned long lastWsPingTime = 0;
unsigned long wsConnectedAt = 0;
unsigned long wsReconnectCount = 0;
bool wifiWasConnected = false;
bool hasIPv6 = false;
String currentIPv6;
String currentIPv6Type = "NONE";
unsigned long lastIPv6TryTime = 0;
uint8_t ipv6TryCount = 0;
bool ipv6RetryExhaustedLogged = false;

void setup() {
  Serial.begin(115200);
  delay(150);
  Serial.println("\n--- ESP32-CAM MQTT + WS 推流启动 ---");
  printMemoryInfo("启动后");
  WiFi.onEvent(onWiFiEvent);

  setupTopics();
  setupFlashPwm();

  if (!initCamera()) {
    Serial.println("[BOOT] 摄像头初始化失败，5秒后重启");
    delay(5000);
    ESP.restart();
  }
  printMemoryInfo("摄像头初始化后");

  setupMqttTransport();
  mqttClient.setServer(mqttHost, mqttPort);
  mqttClient.setCallback(mqttCallback);
  mqttClient.setBufferSize(512);
  mqttClient.setKeepAlive(60);
  mqttClient.setSocketTimeout(15);

  wsClient.onEvent([](WebsocketsEvent event, String data) {
    (void)data;
    if (event == WebsocketsEvent::ConnectionOpened) {
      wsConnectedAt = millis();
      lastWsPingTime = millis();
      Serial.println("[WS] 推流连接成功");
    } else if (event == WebsocketsEvent::ConnectionClosed) {
      unsigned long aliveMs = (wsConnectedAt > 0) ? (millis() - wsConnectedAt) : 0;
      Serial.printf("[WS] 推流连接断开，在线时长=%lu ms, RSSI=%d\n", aliveMs, WiFi.RSSI());
    }
  });
  wsClient.addHeader("Origin", "https://esp.rose980.eu.cc");
  wsClient.addHeader("User-Agent", "ESP32-CAM");
  connectWiFi();
  if (WiFi.status() == WL_CONNECTED) {
    wifiWasConnected = true;
    if (enablePortalAuth) {
      doPortalAuth();
      previousAuthTime = millis();
      delay(1000);
      testInternet();
    }
    syncTimeIfNeeded();
  }

  connectMQTT();
  connectStreamWs();
}

void loop() {
  unsigned long now = millis();

