1033087886/esp32-cam/src/main.cpp
  int end = start;
  while (end < (int)json.length() &&
         json[end] != ',' &&
         json[end] != '}' &&
         !isspace((unsigned char)json[end])) {
    end++;
  }
  return json.substring(start, end);
}

String decodeCommandPayload(byte* payload, unsigned int length) {
  String raw;
  raw.reserve(length + 1);
  for (unsigned int i = 0; i < length; i++) {
    raw += static_cast<char>(payload[i]);
  }
  raw.trim();

  if (!raw.startsWith("{")) {
    return raw;
  }

  String v = extractJsonValue(raw, "light");
  if (v.length() > 0) return v;

  v = extractJsonValue(raw, "msg");
  if (v.length() > 0) return v;

  return raw;
}

bool parseBrightnessCommand(String cmd, uint8_t& outValue) {
  cmd.trim();
  cmd.toLowerCase();

  if (cmd == "on" || cmd == "led/on" || cmd == "1") {
    outValue = 255;
    return true;
  }

  if (cmd == "off" || cmd == "led/off" || cmd == "0") {
    outValue = 0;
    return true;
  }

  char* endPtr = nullptr;
  long value = strtol(cmd.c_str(), &endPtr, 10);
  if (*endPtr != '\0') {
    return false;
  }

  if (value < 0) value = 0;
  if (value > 255) value = 255;
  outValue = static_cast<uint8_t>(value);
  return true;
}

void mqttCallback(char* topic, byte* payload, unsigned int length) {
  String cmd = decodeCommandPayload(payload, length);
  String cmdLower = cmd;
  cmdLower.toLowerCase();

  Serial.printf("[MQTT] 收到消息 topic=%s payload=%s\n", topic, cmd.c_str());

  if (strcmp(topic, topicCmdLight.c_str()) != 0) {
    return;
  }

  if (cmdLower == "ping") {
    publishAck("pong");
    return;
  }

  if (cmdLower == "auth") {
    doPortalAuth();
    publishAck("portal-auth-done");
    return;
  }

  if (cmdLower == "status" || cmdLower == "light/status") {
    publishLightState();
    publishAck("light-status");
    return;
  }

  if (cmdLower == "toggle" || cmdLower == "light/toggle") {
    setFlashBrightness(currentLight > 0 ? 0 : 255, true);
    publishAck("light-toggle");
    return;
  }

  uint8_t nextValue = 0;
  if (parseBrightnessCommand(cmd, nextValue)) {
    setFlashBrightness(nextValue, true);
    publishAck("light-updated");
  } else {
    publishAck("unknown-cmd");
    Serial.println("[MQTT] 无效亮度命令，请用 0-255/on/off/toggle");
  }
}

bool initCamera() {
  camera_config_t config;
  config.ledc_channel = LEDC_CHANNEL_0;
  config.ledc_timer = LEDC_TIMER_0;
  config.pin_d0 = Y2_GPIO_NUM;
  config.pin_d1 = Y3_GPIO_NUM;
  config.pin_d2 = Y4_GPIO_NUM;
  config.pin_d3 = Y5_GPIO_NUM;
  config.pin_d4 = Y6_GPIO_NUM;
  config.pin_d5 = Y7_GPIO_NUM;
  config.pin_d6 = Y8_GPIO_NUM;
  config.pin_d7 = Y9_GPIO_NUM;
  config.pin_xclk = XCLK_GPIO_NUM;
  config.pin_pclk = PCLK_GPIO_NUM;
  config.pin_vsync = VSYNC_GPIO_NUM;
  config.pin_href = HREF_GPIO_NUM;
  config.pin_sccb_sda = SIOD_GPIO_NUM;
  config.pin_sccb_scl = SIOC_GPIO_NUM;
  config.pin_pwdn = PWDN_GPIO_NUM;
  config.pin_reset = RESET_GPIO_NUM;
  config.xclk_freq_hz = 20000000;
  config.pixel_format = PIXFORMAT_JPEG;

  if (psramFound()) {
    config.frame_size = FRAMESIZE_QVGA;
    config.jpeg_quality = 12;
    config.fb_count = 2;
  } else {
    config.frame_size = FRAMESIZE_QQVGA;
    config.jpeg_quality = 16;
    config.fb_count = 1;
  }

#if defined(CAMERA_GRAB_LATEST)
  config.grab_mode = CAMERA_GRAB_LATEST;
#endif
#if defined(CAMERA_FB_IN_PSRAM)
  config.fb_location = CAMERA_FB_IN_PSRAM;
#endif

  esp_err_t err = esp_camera_init(&config);
  if (err != ESP_OK) {
    Serial.printf("[CAM] 初始化失败: 0x%x\n", err);
    return false;
  }

  sensor_t* sensor = esp_camera_sensor_get();
  if (sensor) {
    sensor->set_brightness(sensor, 0);
    sensor->set_saturation(sensor, 0);
  }

  Serial.println("[CAM] 初始化成功");
  return true;
}

void connectStreamWs() {
  if (wsClient.available() || WiFi.status() != WL_CONNECTED) return;

  wsReconnectCount++;
  Serial.println("[WS] 正在连接推流端点: " + String(streamWsUrl));
  Serial.printf("[WS] 重连次数: %lu\n", wsReconnectCount);
  Serial.printf("[WS] 连接前可用堆内存: %u\n", ESP.getFreeHeap());
  if (!wsClient.connect(streamWsHost, streamWsPort, streamWsPath)) {
    Serial.println("[WS] 连接失败");
    Serial.printf("[WS] 连接失败后可用堆内存: %u\n", ESP.getFreeHeap());
  }
}

void sendStreamFrameIfReady() {
  if (!wsClient.available()) return;

  unsigned long now = millis();
  if (now - lastFrameTime < streamInterval) return;

  camera_fb_t* fb = esp_camera_fb_get();
  if (!fb) {
    Serial.println("[CAM] 抓帧失败");
    return;
  }

  bool sent = wsClient.sendBinary((const char*)fb->buf, fb->len);
  esp_camera_fb_return(fb);

  if (!sent) {
    Serial.println("[WS] 发送帧失败，准备重连");
    wsClient.close();
    return;
  }

  lastFrameTime = now;
}

void printMemoryInfo(const char* stage) {
  const bool hasPsram = psramFound();
#if HAS_SPIRAM_CHIP_API
  const int chipEnum = static_cast<int>(esp_spiram_get_chip_size());
  Serial.printf(
    "[MEM] %s | PSRAM芯片探测(enum=%d, %s)\n",
    stage,
    chipEnum,
    psramChipSizeText(chipEnum)
  );
#endif
  Serial.printf(
    "[MEM] %s | PSRAM=%s, PSRAM总=%u, PSRAM可用=%u, Heap总=%u, Heap可用=%u\n",
    stage,
    hasPsram ? "可用" : "不可用",
    ESP.getPsramSize(),
    ESP.getFreePsram(),
    ESP.getHeapSize(),
    ESP.getFreeHeap()
  );
}

const char* psramChipSizeText(int chipEnum) {
  switch (chipEnum) {
    case 0: return "16Mbit (2MB)";
    case 1: return "32Mbit (4MB)";
    case 2: return "64Mbit (8MB)";
    default: return "INVALID/UNKNOWN";
  }
}
